# ============================================================
# config.py
# ============================================================

# -------------------------------
# Ender 3
# -------------------------------

PRINTER_PORT = "/dev/ttyUSB0"
PRINTER_BAUDRATE = 115200

# Размер рабочего поля
BED_SIZE_X = 220.0
BED_SIZE_Y = 220.0

# Центр стола
BED_CENTER_X = BED_SIZE_X / 2.0
BED_CENTER_Y = BED_SIZE_Y / 2.0

# -------------------------------
# Смещение датчика относительно сопла
# -------------------------------

# sensor_x = printer_x + SENSOR_OFFSET_X
# sensor_y = printer_y + SENSOR_OFFSET_Y

SENSOR_OFFSET_X = 11.0
SENSOR_OFFSET_Y = -16.0

# -------------------------------
# Высота сканирования
# -------------------------------

# Расстояние между датчиком и верхней
# поверхностью магнита

SCAN_HEIGHT = 5.0

# -------------------------------
# Скорости
# -------------------------------

MOVE_SPEED = 7000
SCAN_SPEED = 5000
Z_SPEED = 1500

# Пауза после движения
POINT_SETTLE_TIME = 0.02

# -------------------------------
# MLX90393
# -------------------------------

I2C_BUS = 1

# Адрес датчика
MLX90393_ADDRESS = 0x0C

# -------------------------------
# CSV
# -------------------------------

RESULTS_FOLDER = "results"

# -------------------------------
# Настройки измерений
# -------------------------------

# Сколько измерений усреднить
SAMPLES_PER_POINT = 3

# -------------------------------
# Версия проекта
# -------------------------------

PROJECT_NAME = "Magnetic Map"

PROJECT_VERSION = "2.0"